config.org
#+TITLE: apple's GNU Emacs Config
#+AUTHOR: apple115
#+auto_tangle:t
#+STARTUP: overview
#+OPTIONS: toc:2

* early-init.el
:PROPERTIES:
:HEADER-ARGS: :tangle early-init.el
:END:
在Emacs刚启动，还未加载主要配置文件时的配置文件。
#+BEGIN_SRC emacs-lisp
;;; early-init.el --- Emacs pre-initialization config -*- lexical-binding: t -*-
;;; Commentary:

;;; Code:

;; 设置垃圾回收参数
(setq gc-cons-threshold most-positive-fixnum)
(setq gc-cons-percentage 0.6)
;; reduce the frequency of garbage collection by making it happen on
;; each 50MB of allocated data (the default is on every 0.76MB)
(setq gc-cons-threshold 50000000)

;; 启动早期不加载`package.el'包管理器
(setq package-enable-at-startup nil)
;; 不从包缓存中加载
(setq package-quickstart nil)

;; 禁止展示菜单栏、工具栏和纵向滚动条
(push '(menu-bar-lines . 0) default-frame-alist)
(push '(tool-bar-lines . 0) default-frame-alist)
(push '(vertical-scroll-bars) default-frame-alist)

;; 禁止自动缩放窗口先
(setq frame-inhibit-implied-resize t)

;; 禁止菜单栏、工具栏、滚动条模式，禁止启动屏幕和文件对话框
(menu-bar-mode -1)
(tool-bar-mode -1)
(scroll-bar-mode -1)
(setq inhibit-splash-screen t)
(setq use-file-dialog nil)

;; 在这个阶段不编译
(setq inhibit-automatic-native-compilation t)

(provide 'early-init)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; early-init.el ends here
#+END_SRC

* init.el
:PROPERTIES:
:HEADER-ARGS: :tangle init.el
:END:
=init.el= 是emacs的主要配置文件
** init.el 文件头
#+begin_src emacs-lisp
;;; init.el --- The main init entry for Emacs -*- lexical-binding: t -*-
;;; Commentary:

;;; Code:

#+END_SRC
** package 包管理器
#+begin_src emacs-lisp
    (require 'package)
    (setq package-archives
	  '(("melpa"  . "https://melpa.org/packages/")
	    ("gnu"    . "https://elpa.gnu.org/packages/")
	    ("nongnu" . "https://elpa.nongnu.org/nongnu/")))
    (package-initialize)
#+end_src
** 加模块化配
#+BEGIN_SRC emacs-lisp
;; 将lisp目录放到加载路径的前面以加快启动速度
(let ((dir (locate-user-emacs-file "lisp")))
  (add-to-list 'load-path (file-name-as-directory dir)))

;; 加载各模块化配置
;; 不要在`*message*'缓冲区显示加载模块化配置的信息
(with-temp-message ""
 (require 'init-tools)
 (require 'init-ui)                    ; 加载UI交互的模块化配置文件
 (require 'init-completion) ; 加载完成的模块文件
 (require 'init-org)
 (require 'init-langs)
 (require 'init-edit)
 (require 'init-flyspell)
 (require 'init-mind-wave)
 (require 'init-centaur-tabs)
 (require 'init-rime)
 (require 'init-aweshell)
;; (require 'init-js2)
  )
#+END_SRC
** init.el 文件尾
#+BEGIN_SRC emacs-lisp

(provide 'init)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; init.el ends here
#+END_SRC

* init-edit.el
:PROPERTIES:
:HEADER-ARGS: :tangle lisp/init-edit.el :mkdirp yes
:END:
** init-edit.el 文件头

#+BEGIN_SRC emacs-lisp
;;; init-edit.el --- Editing settings -*- lexical-binding: t -*-
;;; Commentary:

;;; Code:

#+END_SRC
**

** evil
#+begin_src emacs-lisp
(use-package evil
    :ensure t
    :init
    (setq evil-want-integration t)
    (setq evil-want-keybinding nil)
    (setq evil-vsplit-window-right t)
    (setq evil-split-window-below t)
    (evil-mode 1)
)

(use-package evil-collection
:ensure t
:after evil
:config
(setq evil-collection-mode-list '(dashboard dired ibuffer calendar vterm eshell magit))
(evil-collection-init))

(use-package evil-surround
  :ensure t
  :config
  (global-evil-surround-mode 1))

(use-package evil-nerd-commenter
  :ensure t
  :init
  (define-key evil-normal-state-map (kbd "gcc") 'evilnc-comment-or-uncomment-lines)
  (define-key evil-visual-state-map (kbd "gcc") 'evilnc-comment-or-uncomment-lines)
)



#+end_src
** avy
#+begin_src emacs-lisp
  (use-package avy
   :ensure t)
#+end_src
** general
#+begin_src emacs-lisp
(use-package general
  :ensure t
  :config
  (general-evil-setup)

  ;; set up 'SPC' as the global leader key
  (general-create-definer dt/leader-keys
    :states '(normal insert visual emacs)
    :keymaps 'override
    :prefix "SPC" ;; set leader
    :global-prefix "M-SPC") ;; access leader in insert mode

  (dt/leader-keys
    "." '(find-file :wk "Find file")
   "f c" '((lambda () (interactive) (find-file "~/.config/emacs/config.org")) :wk "Edit emacs config")
   "f s" '((lambda () (interactive) (find-file "~/.config/emacs/snippets")) :wk "Edit emacs snippet"))

  (dt/leader-keys
   "c f" '((lambda () (interactive) (format-all-buffer)) :wk "current buffer format"))

  (dt/leader-keys
    "b" '(:ignore t :wk "buffer")
    "b b" '(switch-to-buffer :wk "Switch buffer")
    "b i" '(ibuffer :wk "Ibuffer")
    "b k" '(kill-buffer :wk "Kill this buffer")
    "b r" '(revert-buffer :wk "Reload buffer")
    "bn" '(next-buffer :wk "Next buffer")
    "bp" '(previous-buffer :wk "Previous buffer"))

  (dt/leader-keys
    "e" '(:ignore t :wk "Evaluate")
    "e b" '(eval-buffer :wk "Evaluate elisp in buffer")
    "e d" '(eval-defun :wk "Evaluate defun containing or after point")
    "e e" '(eval-expression :wk "Evaluate and elisp expression")
    "e l" '(eval-last-sexp :wk "Evaluate elisp expression before point")
    "e r" '(eval-region :wk "Evaluate elisp in region"))


(defun my-load-config ()
"Load Emacs configuration."
(interactive)
(load-file "~/.config/emacs/init.el"))

(defun my-open-termial-kitty ()
"open kitty terminal in load filepath"
(interactive)
(let ((directory (eshell/pwd)))
(async-shell-command (format "kitty --directory %s" directory))
))

   (dt/leader-keys
    "h" '(:ignore t :wk "Help")
    "h f" '(describe-function :wk "Describe function")
    "h v" '(describe-variable :wk "Describe variable")
    "h r r" '(my-load-config :wk "Reload Emacs config")
)

   (dt/leader-keys
    "t" '(:ignore t :wk "Toggle")
    "t l" '(display-line-numbers-mode :wk "Toggle line numbers")
    "t e" '(aweshell-dedicated-toggle :wk "aweshell")
    "t t" '(visual-line-mode :wk "Toggle truncated lines"))

   (dt/leader-keys
    "o" '(:ignore t :wk "open")
    "o t" '(my-open-termial-kitty :wk "open terminal")
    "o c" '((lambda () (interactive) (org-capture)) :wk "open org-capture")
    "o a" '((lambda () (interactive) (org-agenda)) :wk "open org-agenda"))

   (dt/leader-keys
    "x" '(:ignore t :wk "open")
    "x x" '(lsp-bridge-diagnostic-list :wk "show diagnostic list")
    "x c" '(lsp-bridge-diagnostic-copy :wk "copy diagnostic list"))

   (dt/leader-keys
    "p" '(:ignore t :wk "project")
    "p p" '(projectile-switch-project :wk "project switch project")
    "p f" '(projectile-find-file :wk "project find file")
    "p d" '(projectile-dired :wk "project dired")
    "p b" '(projectile-switch-to-buffer :wk "project switch buffer"))

   (dt/leader-keys
    "d" '(:ignore t :wk "denote")
    "d n" '(denote :wk "show diagnostic list")
    "d d" '(denote-date :wk "copy diagnostic list")
    "d t" '(denote-type :wk "copy diagnostic list")
    "d s" '(denote-subdirectory :wk "copy diagnostic list")
    "d f" '(denote-open-or-create :wk "copy diagnostic list")
    "d r" '(denote-dired-rename-file :wk "copy diagnostic list"))
)

#+end_src
** sudo-edit
#+begin_src emacs-lisp
(use-package sudo-edit
  :ensure t
  :config
    (dt/leader-keys
      "fu" '(sudo-edit-find-file :wk "Sudo find file")
      "fU" '(sudo-edit :wk "Sudo edit file")))
#+end_src
** saveplace 记住光标的位置
#+begin_src emacs-lisp
(use-package saveplace
  :ensure nil
  :hook (after-init . save-place-mode))
#+end_src
** smart-input-sourc
##+begin_src emacs-lisp
(use-package sis
  ;; :hook
  ;; enable the /context/ and /inline region/ mode for specific buffers
  ;; (((text-mode prog-mode) . sis-context-mode)
  ;;  ((text-mode prog-mode) . sis-inline-mode))
  :ensure t
  :config


  (sis-ism-lazyman-config "1" "2" 'fcitx5)
  ;; enable the /cursor color/ mode
  ;;(sis-global-cursor-color-mode t)
  ;; enable the /respect/ mode
  ;;(sis-global-respect-mode t)
  ;; enable the /context/ mode for all buffers
  ;;(sis-global-context-mode t)
  ;; enable the /inline english/ mode for all buffers
  ;;(sis-global-inline-mode t)
  )

##+end_src
** 括号补全
#+begin_src emacs-lisp
(use-package elec-pair
  :ensure nil
  :hook (after-init . electric-pair-mode)
  :init (setq electric-pair-inhibit-predicate 'electric-pair-conservative-inhibit))
#+end_src

** keymap
#+begin_src emacs-lisp



;; 定义快捷键在 rust-mode 下生效
(with-eval-after-load 'rust-mode
  (evil-define-key 'normal rust-mode-map (kbd "C-k") 'lsp-bridge-popup-documentation)
  (evil-define-key 'normal rust-mode-map (kbd "gd") 'lsp-bridge-find-def)
  (evil-define-key 'normal rust-mode-map (kbd "gi") 'lsp-bridge-find-imp)
  (evil-define-key 'normal rust-mode-map (kbd "go") 'lsp-bridge-find-def-return)
  (general-evil-define-key 'normal rust-mode-map
  :prefix "SPC"
  "5" 'rust-run
  "9" 'rust-compile)
)

;; 定义快捷键在 python-mode 下生效
(with-eval-after-load 'python-mode
  (evil-define-key 'normal python-mode-map (kbd "C-k") 'lsp-bridge-popup-documentation)
  (evil-define-key 'normal python-mode-map (kbd "gd") 'lsp-bridge-find-def)
  (evil-define-key 'normal python-mode-map (kbd "gi") 'lsp-bridge-find-imp)
  (evil-define-key 'normal python-mode-map (kbd "go") 'lsp-bridge-find-def-return)
  (define-key python-mode-map (kbd"<tab>") #'yas-expand)
  (general-evil-define-key 'normal python-mode-map
  :prefix "SPC"
  "5" 'quickrun)
)

;; 可以继续为其他模式添加类似的代码

(evil-collection-define-key 'insert 'lsp-bridge-mode-map (kbd "C-n") #'acm-select-next)
(evil-collection-define-key 'insert 'lsp-bridge-mode-map (kbd "C-p") #'acm-select-prev)
;; agenda

(add-hook 'org-agenda-mode-hook
          (lambda ()
            (evil-set-initial-state 'org-agenda-mode 'normal)))
  (evil-define-key 'normal org-agenda-mode-map (kbd "q") 'org-agenda-quit)


  (evil-define-key 'normal org-agenda-mode-map (kbd "j") 'org-agenda-next-line)
  (evil-define-key 'normal org-agenda-mode-map (kbd "k") 'org-agenda-previous-line)


  (evil-define-key 'normal org-agenda-mode-map (kbd "<tab>") 'org-agenda-todo)
  (evil-define-key 'normal org-agenda-mode-map (kbd "gc") 'org-agenda-goto-calender)
  (evil-define-key 'normal org-agenda-mode-map (kbd "gr") 'org-agenda-redo)

  (evil-define-key 'normal org-agenda-mode-map (kbd "u") 'org-agenda-undo)

;; capture
(add-hook 'org-capture-mode-hook
          (lambda ()
            (evil-set-initial-state 'org-capture-mode 'normal)))


;; vim keymap setting
 (evil-define-key  'normal global-map (kbd "f") 'avy-goto-char-timer)

  (evil-define-key 'normal org-mode-map (kbd "<tab>") 'org-cycle)

  (evil-define-key 'normal global-map (kbd "H") 'evil-beginning-of-line)
  (evil-define-key 'normal global-map (kbd "L") 'evil-end-of-line)
  (evil-define-key 'visual global-map (kbd "H") 'evil-beginning-of-line)
  (evil-define-key 'visual global-map (kbd "L") 'evil-end-of-line)
  (evil-define-key 'normal global-map (kbd "C-.") 'popper-toggle)
  (evil-define-key 'normal global-map (kbd "M-.") 'popper-cycle)
#+end_src

** init-edit.el 文件尾

#+BEGIN_SRC emacs-lisp
;; (message "init-base configuration: %.2fs"
;;          (float-time (time-subtract (current-time) my/init-base-start-time)))

(provide 'init-edit)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; init-edit.el ends here
#+END_SRC

* init-ui.el
:PROPERTIES:
:HEADER-ARGS: :tangle lisp/init-ui.el :mkdirp yes
:END:
** init-ui.el 文件头
#+BEGIN_SRC emacs-lisp
;;; init-ui.el --- UI settings -*- lexical-binding: t -*-
;;; Commentary:

;;; Code:

#+END_SRC

** gruvbox 主题
#+begin_src emacs-lisp
(load-theme 'gruvbox-light-hard t)
#+end_src
** 字体设置
#+begin_src emacs-lisp
(set-face-attribute 'default nil :font (font-spec :family "Inconsolata" :size 18 :weight 'bold))
 ;; (set-fontset-font t 'unicode (font-spec :family "Noto Color Emoji" :size 14))
(set-fontset-font t '(#x2ff0 . #x9ffc) (font-spec :family "LXGW WenKai" :size 18 :weight 'bold))
;;测试一下这个

#+end_src
#+CAPTION: 测试中英文字体对齐
#+NAME: 测试中英文字体对齐
|中文|
|abcd|

